Revit 2025 API
ParameterFilterRuleFactory.CreateBeginsWithRule Method
Overload List
Name | Description
CreateBeginsWithRule(ElementId, String) |  Creates a filter rule that determines whether strings from the document begin with a certain string value.
CreateBeginsWithRule(ElementId, String, Boolean) | Obsolete.
 Creates a filter rule that determines whether strings from the document begin with a certain string value.
Top
See Also
Reference
ParameterFilterRuleFactory Class
Autodesk.Revit.DB Namespace